AK47n/firstep/library/masters/mspm0/mspm0.syscfg
// 人体红外感应输入（human_ir 模块：OUT 输入 + 内部上拉——HC-SR501 模块被
// 感应到人体时输出高电平（模块介绍「人进入其感应范围则输出高电平」+ 规格
// 「电平输出：高3.3V/低0V」；页面函数注释「0=感应到」与介绍矛盾——按
// HC-SR501 器件标准高=检测到修正，模块 notes 记录）；电平直读无去抖/无
// GPIO 中断（GROUP1 仍被 motor 编码器独占，页面同为电平直读）。默认 PB8——
// 与 STEP_MOTOR DCY2 / SR04 ECHO / AT24C02 SDA 重叠：人体红外与步进/测距/
// 存储不同框、同选概率最低（感应灯/防盗报警惯配温湿度/光照/显示/语音/无线/
// 按键/蜂鸣——刻意不叠），同选时经引脚绑定消解）
const HUMAN_IR = GPIO.addInstance();
HUMAN_IR.$name = "HUMAN_IR";
HUMAN_IR.associatedPins.create(1);
HUMAN_IR.associatedPins[0].$name            = "OUT";
HUMAN_IR.associatedPins[0].direction        = "INPUT";
HUMAN_IR.associatedPins[0].internalResistor = "PULL_UP";
HUMAN_IR.associatedPins[0].pin.$assign      = "PB8";

// 微波多普勒雷达输入（microwave_radar 模块：OUT 输入 + 内部上拉——HB100
// 模块检测到物体移动时 OUT 低电平（页面函数注释「1=未检测到 0=检测到」+
// main 演示（OUT 输入为 0 判移动）同口径，页面自一致）；电平直读无去抖/无
// GPIO 中断（GROUP1 仍被 motor 编码器独占，页面同为电平直读）；页面演示的
// 开/关门时序逻辑归生成骨架（ADR 0009）。默认 PA31——2026-09-06 SysConfig
// CLI 实证 PA0/PA1 不在 GPIO 输入实例 pin 选项内（"No option named PA0
// defined"；GPIO 输出可配 PA0——ir_remote_tx 先例，输入不可）→ 改选
// PA31：与 IMU601 RX（姿态）/HX711 DT（称重）/FINGERPRINT_UART RX（身份）/
// SHT30 SDA（温湿度）重叠——微波雷达（自动门/车流/倒车）与姿态/称重/身份/
// 温湿度采集不同框、同选概率最低（自动门/车流惯配电机/显示/蜂鸣/无线/超声/
// 人体红外——刻意不叠：PWMAB/MAX7219/LED_BEEP/无线族/SR04 脚/human_ir PB8），
// 同选时经引脚绑定消解；与同批 human_ir（PB8）刻意错开（人体红外+微波组合
// 常同选，默认即不撞）
const MICROWAVE = GPIO.addInstance();
MICROWAVE.$name = "MICROWAVE";
MICROWAVE.associatedPins.create(1);
MICROWAVE.associatedPins[0].$name            = "OUT";
MICROWAVE.associatedPins[0].direction        = "INPUT";
MICROWAVE.associatedPins[0].internalResistor = "PULL_UP";
MICROWAVE.associatedPins[0].pin.$assign      = "PA31";

// GP2Y1014AU 粉尘传感器 LED 驱动输出（gp2y1014au 模块：LED 脉冲驱动——页面
// Read_dust_concentration 时序：clear（LED 亮）→ 280us → 采样 → 40us → set
// （LED 关）→ 9680us，10ms 周期；**器件必需**——GP2Y1014AU 内置红外 LED
// 必须由主控脉冲驱动才能测量，无此脚传感器不工作（薄封装件唯一例外：ADC 仍
// 薄封装共读 MEM0（见 ADC 段），LED 为 GPIO 输出实例）。页面极性原样：
// clear = LED 亮、set = LED 关（空闲高 = 关闭）。默认 PA1——与 I2C_0 sclPin
// （ml_mpu6050 硬 I2C SCL）重叠：粉尘浓度监测与姿态采集不同框、同选概率
// 最低故叠此脚（PA0/PA1 不可作 GPIO 输入——2026-09-06 SysConfig CLI 实证；
// GPIO 输出可配 PA0——ir_remote_tx 先例，PA1 同型经编译矩阵 CLI 实证），
// 同选时经引脚绑定消解；刻意不叠传感站标配（温湿度/光照/气体/显示）、
// 报警（PA15 蜂鸣）、无线/触摸/运动/语音件——粉尘监测站 = 显示 + 报警 +
// 温湿度 + 无线遥测常见组合，默认即不撞）
const GP2Y1014 = GPIO.addInstance();
GP2Y1014.$name = "GP2Y1014";
GP2Y1014.associatedPins.create(1);
GP2Y1014.associatedPins[0].$name            = "LED";
GP2Y1014.associatedPins[0].direction        = "OUTPUT";
GP2Y1014.associatedPins[0].initialValue     = "SET";
GP2Y1014.associatedPins[0].pin.$assign      = "PA1";

// 双轴摇杆按键（joystick 模块：SW 输入上拉低有效；实例名 JOYSTICK →
// JOYSTICK_PORT 宏；引脚名 SW → JOYSTICK_SW_PIN；默认 PA9——仅与
// DIGIT_UART RX 默认重叠（K230 视觉串口），同选时经引脚绑定消解。
// X/Y 两轴走 ADC12_0 MEM1/MEM2（见 ADC 段），SW 独立 GPIO）
JOYSTICK.$name = "JOYSTICK";
JOYSTICK.associatedPins.create(1);
JOYSTICK.associatedPins[0].$name            = "SW";
JOYSTICK.associatedPins[0].direction        = "INPUT";
JOYSTICK.associatedPins[0].internalResistor = "PULL_UP";
JOYSTICK.associatedPins[0].pin.$assign  = "PA9";

// HC05 蓝牙（hc05 模块：STATE 输入 = 连接状态指示（模块 STATE 脚高 = 手机
// 已连接；默认 PA8——与 DIGIT_UART TX / IR_BEAM OUT 默认重叠：K230 视觉/
// 红外对射与蓝牙链路互替，同选时经引脚绑定消解）；KEY 输出 = AT 模式切换
// 按键（KEY 高 + 重上电 = AT 命令模式；默认 PB24——与 STEP_MOTOR RST2 /
// SR04 TRIG 重叠，AT 切换不常用，同选时经引脚绑定消解））
HC05.$name = "HC05";
HC05.associatedPins.create(2);
HC05.associatedPins[0].$name            = "STATE";
HC05.associatedPins[0].direction        = "INPUT";
HC05.associatedPins[0].pin.$assign      = "PA8";
HC05.associatedPins[1].$name            = "KEY";
HC05.associatedPins[1].direction        = "OUTPUT";
HC05.associatedPins[1].initialValue     = "CLEARED";
HC05.associatedPins[1].pin.$assign      = "PB24";

// NRF24L01 2.4G 无线（nrf24l01 模块：软 SPI 位操作 6 脚——CLK/MOSI/CSN/CE
// 输出 + MISO/IRQ 输入；IRQ 输入不配中断（GPIO 中断只有 GROUP1 一路且被
// motor 编码器独占——NRF+电机是双车标配组合，定义第二个 GROUP1_IRQHandler
// 会链接期冲突，按手册轮询方式接收）。默认全 GPIOA 单口：CLK=PA26/MOSI=PA25/
// MISO=PA9/CSN=PA24/CE=PA23/IRQ=PA22——与 ZIGBEE_UART（PA26/PA25）、
// UWB/DEBUG_UART（PA23/PA24/PA22）、HUIDU 巡线（PA22-26）、joystick X/Y、
// adc、DIGIT_UART（PA9）默认重叠：NRF 与其它无线/巡线/手动输入互替、同选
// 概率最低，同选时经引脚绑定消解）
NRF24L01.$name = "NRF24L01";
NRF24L01.associatedPins.create(6);
NRF24L01.associatedPins[0].$name        = "CLK";
NRF24L01.associatedPins[0].direction    = "OUTPUT";
NRF24L01.associatedPins[0].initialValue = "CLEARED";
NRF24L01.associatedPins[0].pin.$assign  = "PA26";
NRF24L01.associatedPins[1].$name        = "MOSI";
NRF24L01.associatedPins[1].direction    = "OUTPUT";
NRF24L01.associatedPins[1].initialValue = "CLEARED";
NRF24L01.associatedPins[1].pin.$assign  = "PA25";
NRF24L01.associatedPins[2].$name        = "MISO";
NRF24L01.associatedPins[2].direction    = "INPUT";
NRF24L01.associatedPins[2].pin.$assign  = "PA9";
NRF24L01.associatedPins[3].$name        = "CSN";
NRF24L01.associatedPins[3].direction    = "OUTPUT";
NRF24L01.associatedPins[3].initialValue = "SET";
NRF24L01.associatedPins[3].pin.$assign  = "PA24";
NRF24L01.associatedPins[4].$name        = "CE";
NRF24L01.associatedPins[4].direction    = "OUTPUT";
NRF24L01.associatedPins[4].initialValue = "CLEARED";
NRF24L01.associatedPins[4].pin.$assign  = "PA23";
NRF24L01.associatedPins[5].$name        = "IRQ";
NRF24L01.associatedPins[5].direction    = "INPUT";
NRF24L01.associatedPins[5].pin.$assign  = "PA22";

// IPS 彩屏（lcd 模块，批次 12 决策 A：六屏合一单模块——ST7735/ST7735S/
// ST7789V2/ST7789V3/GC9A01 差异 = 初始化序列+分辨率+偏移表，lcd_init(型号,
// 方向) 运行时选择；软 SPI 位操作不占硬件 SPI 外设/TIMER——nrf24l01/max7219
// 先例）。六脚全输出：SCL=PA16（与 DC_MOTOR 编码器 AA/RC522 MOSI/ADS1115 SCL/
// SHT20 SCL 重叠）、SDA=PA17（编码器 AB/RC522 MISO/ADS1115 SDA/SHT20 SDA）、
// RES=PA27（与 HUIDU R2/ADC ir_distance/TTP224 OUT4 重叠）、DC=PA22（与 HUIDU
// L1/NRF24L01 IRQ/ZIGBEE DEBUG RX/TTP224 OUT1/flame 重叠）、CS=PB19（与
// JQ8900 语音重叠）、BLK=PB20（与 SYN6288 语音/mq135 重叠）——各对按「同选
// 概率最低者与既有默认重叠」：彩屏与巡线车/无线链路/语音播报/触摸/读卡/
// 气体互替不同框（刻意不叠显示族 oled/max7219/ws2812/led 与环境站温湿度/
// 光照/红外测温/粉尘——彩屏显示环境数据是常见组合；不叠 PA0/PA1——
// i2c_bus_share 测试互扰，批次 5 实测先例），同选时经引脚绑定消解；CS/BLK
// 初始 SET（片选空闲/开背光），其余输出初始 CLEARED。
LCD.$name = "LCD";
LCD.associatedPins.create(6);
LCD.associatedPins[0].$name        = "SCL";
LCD.associatedPins[0].direction    = "OUTPUT";
LCD.associatedPins[0].initialValue = "CLEARED";
LCD.associatedPins[0].pin.$assign  = "PA16";
LCD.associatedPins[1].$name        = "SDA";
LCD.associatedPins[1].direction    = "OUTPUT";
LCD.associatedPins[1].initialValue = "CLEARED";
LCD.associatedPins[1].pin.$assign  = "PA17";
LCD.associatedPins[2].$name        = "RES";
LCD.associatedPins[2].direction    = "OUTPUT";
LCD.associatedPins[2].initialValue = "CLEARED";
LCD.associatedPins[2].pin.$assign  = "PA27";
LCD.associatedPins[3].$name        = "DC";
LCD.associatedPins[3].direction    = "OUTPUT";
LCD.associatedPins[3].initialValue = "CLEARED";
LCD.associatedPins[3].pin.$assign  = "PA22";
LCD.associatedPins[4].$name        = "CS";
LCD.associatedPins[4].direction    = "OUTPUT";
LCD.associatedPins[4].initialValue = "SET";
LCD.associatedPins[4].pin.$assign  = "PB19";
LCD.associatedPins[5].$name        = "BLK";
LCD.associatedPins[5].direction    = "OUTPUT";
LCD.associatedPins[5].initialValue = "SET";
LCD.associatedPins[5].pin.$assign  = "PB20";

// XPT2046 电阻触摸（tp_xpt2046 模块，批次 12/06——1.8 寸屏配套独立件，与
// lcd 零耦合：共用 SCLK/MOSI 接线由引脚绑定自选，默认脚独立互不相撞）。
// 五脚：CLK/DIN/CS 输出（CS 初始 SET=片选空闲）+ DOUT/PEN 输入。默认
// CS=PA8（与 DIGIT_UART TX/IR_BEAM/HC05 STATE/MLX90614 SDA/OPENMV4 TX 重叠
// ——触摸与视觉/红外对射/蓝牙链路互替、同选概率最低）、CLK=PA13（与
// PWMAB C1/BH1750 SDA 重叠）、DIN=PA9（与 DIGIT_UART RX/JOYSTICK SW/NRF
// MISO/MLX90614 SCL/OPENMV4 RX 重叠）、DOUT=PA28（与 IMU601/HX711/
// FINGERPRINT_UART/SHT30/JY61P 重叠——姿态/称重/温湿度采集不同框）、
// PEN=PB24（与 STEP_MOTOR RST2/SR04 TRIG/HC05 KEY/AT24C02 SCL/mq5 ADC/
// L298N PWM2 重叠——步进/测距/存储/气体不同框）——各对按「同选概率最低者
// 与既有默认重叠」：触摸与视觉链路/手动输入/姿态/步进不同框，且刻意不叠
// LCD 六脚（PA16/PA17/PA27/PA22/PB19/PB20——触摸与彩屏常同选，默认即不
// 撞），同选时经引脚绑定消解。
TP_XPT2046.$name = "TP_XPT2046";
TP_XPT2046.associatedPins.create(5);
TP_XPT2046.associatedPins[0].$name        = "CS";
TP_XPT2046.associatedPins[0].direction    = "OUTPUT";
TP_XPT2046.associatedPins[0].initialValue = "SET";
TP_XPT2046.associatedPins[0].pin.$assign  = "PA8";
TP_XPT2046.associatedPins[1].$name        = "CLK";
TP_XPT2046.associatedPins[1].direction    = "OUTPUT";
TP_XPT2046.associatedPins[1].initialValue = "CLEARED";
TP_XPT2046.associatedPins[1].pin.$assign  = "PA13";
TP_XPT2046.associatedPins[2].$name        = "DIN";
TP_XPT2046.associatedPins[2].direction    = "OUTPUT";
TP_XPT2046.associatedPins[2].initialValue = "CLEARED";
TP_XPT2046.associatedPins[2].pin.$assign  = "PA9";
TP_XPT2046.associatedPins[3].$name        = "DOUT";
TP_XPT2046.associatedPins[3].direction    = "INPUT";
TP_XPT2046.associatedPins[3].pin.$assign  = "PA28";
TP_XPT2046.associatedPins[4].$name        = "PEN";
TP_XPT2046.associatedPins[4].direction    = "INPUT";
TP_XPT2046.associatedPins[4].pin.$assign  = "PB24";

// SPI 总线 OLED 0.96 单色屏（oled 模块 SPI 变体，批次 12/07 决策 B——同芯片
// SSD1306 同 API，仅总线层不同：5 脚软 SPI 位操作 SCL/SDA/DC/CS/RES，不占
// 硬件 SPI 外设/TIMER——nrf24l01/max7219 先例；I2C1「OLED」实例与此并存
// （选任一总线时两实例都保留：已知取舍 = SPI 模式下 I2C1 的 PB2/PB3 仍被
// 占用，需要时经引脚绑定换脚消解，见 oled manifest notes）。默认
// SCL=PA28/SDA=PA31（与 IMU601/HX711/FINGERPRINT_UART/SHT30/JY61P/TP DOUT
// 重叠——单色 SPI 屏与姿态/称重/身份/温湿度采集不同框、同选概率最低）、
// DC=PA13（与 PWMAB C1/BH1750 SDA/TP CLK 重叠）、CS=PB18（与 MAX7219 CS/
// AGS10 SCL 重叠——显示互替件同框罕见）、RES=PA22（与 HUIDU L1/NRF IRQ/
// TTP224/flame/TP… 重叠——巡线/无线不同框）——刻意不叠 oled I2C 的 PB2/PB3
// 与彩屏 LCD 六脚，同选时经引脚绑定消解；CS/RES 初始 SET（片选空闲/复位
// 空闲高），其余输出初始 CLEARED。
OLED_SPI.$name = "OLED_SPI";
OLED_SPI.associatedPins.create(5);
OLED_SPI.associatedPins[0].$name        = "SCL";
OLED_SPI.associatedPins[0].direction    = "OUTPUT";
OLED_SPI.associatedPins[0].initialValue = "CLEARED";
OLED_SPI.associatedPins[0].pin.$assign  = "PA28";
OLED_SPI.associatedPins[1].$name        = "SDA";
OLED_SPI.associatedPins[1].direction    = "OUTPUT";
OLED_SPI.associatedPins[1].initialValue = "CLEARED";
OLED_SPI.associatedPins[1].pin.$assign  = "PA31";
OLED_SPI.associatedPins[2].$name        = "DC";
OLED_SPI.associatedPins[2].direction    = "OUTPUT";
OLED_SPI.associatedPins[2].initialValue = "CLEARED";
OLED_SPI.associatedPins[2].pin.$assign  = "PA13";
OLED_SPI.associatedPins[3].$name        = "CS";
OLED_SPI.associatedPins[3].direction    = "OUTPUT";
OLED_SPI.associatedPins[3].initialValue = "SET";
OLED_SPI.associatedPins[3].pin.$assign  = "PB18";
OLED_SPI.associatedPins[4].$name        = "RES";
OLED_SPI.associatedPins[4].direction    = "OUTPUT";
OLED_SPI.associatedPins[4].initialValue = "SET";
OLED_SPI.associatedPins[4].pin.$assign  = "PA22";

// 红外遥控接收（ir_remote 模块：OUT 输入（接收头输出直接接 GPIO，上拉 = 无
// 信号高电平、有信号拉低）；NEC 解码用 CPU 忙等采样（delay 模块 20us 步进），
// 不占 TIMER（TIMG 全占，sr04 先例）；主循环轮询解码、不注册 GPIO 中断
// （GROUP1 只有一路且被 motor 编码器独占——红外+电机是经典组合）。默认
// PA26——与 ZIGBEE_TX/joystick X/NRF24L01 CLK 默认重叠（红外与其它无线/
// 手动输入互替、同选概率最低），同选时经引脚绑定消解）
IR_REMOTE.$name = "IR_REMOTE";
IR_REMOTE.associatedPins.create(1);
IR_REMOTE.associatedPins[0].$name            = "OUT";
IR_REMOTE.associatedPins[0].direction        = "INPUT";
IR_REMOTE.associatedPins[0].internalResistor = "PULL_UP";
IR_REMOTE.associatedPins[0].pin.$assign      = "PA26";

