AK47n/firstep/library/masters/mspm0/mspm0.syscfg
// MAX7219 数码管/点阵（max7219 模块：软 SPI 位操作 3 脚 DIN/CLK/CS，全强推挽
// 输出；位操作不占硬件 SPI 外设；CS 初始高 = 片选空闲。默认 DIN=PB9（与
// DC_MOTOR AIN1 重叠）/CLK=PA18（与 DC_MOTOR AIN2 重叠——PA18 兼 BSL 排针
// 脚，作输出无碍）/CS=PB18（与 DC_MOTOR BIN1 重叠）——大数字显示（计分/
// 计时/数据牌类固定装置）与双电机小车同选概率最低（小车状态显示惯走
// OLED），同选时经引脚绑定消解）
const MAX7219 = GPIO.addInstance();
MAX7219.$name = "MAX7219";
MAX7219.associatedPins.create(3);
MAX7219.associatedPins[0].$name        = "DIN";
MAX7219.associatedPins[0].direction    = "OUTPUT";
MAX7219.associatedPins[0].initialValue = "CLEARED";
MAX7219.associatedPins[0].pin.$assign  = "PB9";
MAX7219.associatedPins[1].$name        = "CLK";
MAX7219.associatedPins[1].direction    = "OUTPUT";
MAX7219.associatedPins[1].initialValue = "CLEARED";
MAX7219.associatedPins[1].pin.$assign  = "PA18";
MAX7219.associatedPins[2].$name        = "CS";
MAX7219.associatedPins[2].direction    = "OUTPUT";
MAX7219.associatedPins[2].initialValue = "SET";
MAX7219.associatedPins[2].pin.$assign  = "PB18";

// PCA9685 16 路舵机驱动板（pca9685 模块：软 I2C 位操作 2 脚 SCL/SDA——照
// AHT10 先例不占硬件 I2C 外设；SDA 方向运行时切换（写 = 输出、读 ACK = 输入）。
// 默认 SCL=PB6 / SDA=PB7——与 STEP_MOTOR SLP2/DIR2、HUIDU R3/R4、
// AHT10 SCL/SDA（软 I2C 同型）、DHT11 DATA 重叠：16 路舵机多自由度执行与
// 温湿度采集（环境站类）/步进电机（单轴执行，互替）/8 路灰度巡线（车类）
// 同选概率最低，同选时经引脚绑定消解；软 I2C 需板上/模块自带上拉）
const PCA9685 = GPIO.addInstance();
PCA9685.$name = "PCA9685";
PCA9685.associatedPins.create(2);
PCA9685.associatedPins[0].$name        = "SCL";
PCA9685.associatedPins[0].direction    = "OUTPUT";
PCA9685.associatedPins[0].initialValue = "CLEARED";
PCA9685.associatedPins[0].pin.$assign  = "PB6";
PCA9685.associatedPins[1].$name        = "SDA";
PCA9685.associatedPins[1].direction    = "OUTPUT";
PCA9685.associatedPins[1].initialValue = "CLEARED";
PCA9685.associatedPins[1].pin.$assign  = "PB7";

// 红外编码发射（ir_remote_tx 模块：OUT 输出强推挽，38kHz NEC 载波位时序
// CPU 忙等 + delay 模块换算，不占 TIMER（照 ir_remote/ws2812 先例）；初始
// 低 = 载波空闲。默认 PA0——与 I2C_0 SDA（ml_mpu6050 姿态）/板载 LED 重叠
// （红外发射链与姿态采集同选概率最低；板载 LED 随载波闪烁可作发射指示），
// 且与 IR_REMOTE 默认 PA26 刻意错开（发射/接收本就常配对——双选默认即不撞，
// 同选时经引脚绑定消解）
const IR_TX = GPIO.addInstance();
IR_TX.$name = "IR_TX";
IR_TX.associatedPins.create(1);
IR_TX.associatedPins[0].$name        = "OUT";
IR_TX.associatedPins[0].direction    = "OUTPUT";
IR_TX.associatedPins[0].initialValue = "CLEARED";
IR_TX.associatedPins[0].pin.$assign  = "PA0";

// JQ8900 语音播报（jq8900 模块：软 UART 单发 TX——GPIO 位操作 9600 8N1，
// 不占 UART 外设/TIMER（批次 4 UART 可行性调研：SysConfig CLI 拒绝同一
// UART 外设多实例，语音单向发指令帧走软 UART）；TX 输出初始 SET = 空闲高。
// 默认 PB19——DC_MOTOR 编码器 BA 脚：语音播报与双电机小车同选概率最低，
// 同选时经引脚绑定消解；与同批 syn6288 默认 PB20 刻意错开（语音两件常同选））
const JQ8900 = GPIO.addInstance();
JQ8900.$name = "JQ8900";
JQ8900.associatedPins.create(1);
JQ8900.associatedPins[0].$name        = "TX";
JQ8900.associatedPins[0].direction    = "OUTPUT";
JQ8900.associatedPins[0].initialValue = "SET";
JQ8900.associatedPins[0].pin.$assign  = "PB19";

// SYN6288 语音合成（syn6288 模块：软 UART 单发 TX——同 jq8900 先例，不占
// UART 外设/TIMER；TX 输出初始 SET = 空闲高。默认 PB20——DC_MOTOR 编码器
// BB 脚：语音合成与双电机小车同选概率最低；与同批 jq8900 默认 PB19 刻意
// 错开（语音两件常同选，默认即不撞），同选时经引脚绑定消解）
const SYN6288 = GPIO.addInstance();
SYN6288.$name = "SYN6288";
SYN6288.associatedPins.create(1);
SYN6288.associatedPins[0].$name        = "TX";
SYN6288.associatedPins[0].direction    = "OUTPUT";
SYN6288.associatedPins[0].initialValue = "SET";
SYN6288.associatedPins[0].pin.$assign  = "PB20";

// RC522 射频 IC 卡识别（rc522 模块：软 SPI 位操作 5 脚——CS/RST/SCK/MOSI
// 输出 + MISO 输入，单 RC522_PORT 宏；不占硬件 SPI 外设（nrf24l01 先例）。
// 默认 CS=PA7（DC_MOTOR BIN2 + SERVO_PWM 重叠）/RST=PA18（DC_MOTOR AIN2 +
// MAX7219 CLK）/SCK=PA14（DCC_100_PWM2 + WS2812 IN）/MOSI=PA16（编码器
// AA）/MISO=PA17（编码器 AB）——读卡与车类（双电机/舵机/步进）同选概率
// 最低，同选时经引脚绑定消解；五脚全 GPIOA 单口，与同批语音/指纹默认不撞）
const RC522 = GPIO.addInstance();
RC522.$name = "RC522";
RC522.associatedPins.create(5);
RC522.associatedPins[0].$name        = "CS";
RC522.associatedPins[0].direction    = "OUTPUT";
RC522.associatedPins[0].initialValue = "SET";
RC522.associatedPins[0].pin.$assign  = "PA7";
RC522.associatedPins[1].$name        = "RST";
RC522.associatedPins[1].direction    = "OUTPUT";
RC522.associatedPins[1].initialValue = "SET";
RC522.associatedPins[1].pin.$assign  = "PA18";
RC522.associatedPins[2].$name        = "SCK";
RC522.associatedPins[2].direction    = "OUTPUT";
RC522.associatedPins[2].initialValue = "SET";
RC522.associatedPins[2].pin.$assign  = "PA14";
RC522.associatedPins[3].$name        = "MOSI";
RC522.associatedPins[3].direction    = "OUTPUT";
RC522.associatedPins[3].initialValue = "CLEARED";
RC522.associatedPins[3].pin.$assign  = "PA16";
RC522.associatedPins[4].$name        = "MISO";
RC522.associatedPins[4].direction    = "INPUT";
RC522.associatedPins[4].pin.$assign  = "PA17";

// 指纹模块触摸感应输入（fingerprint 模块：模块 5 脚触摸信号输出高 = 检测到
// 触摸，VTI 接 3.3V——直连 GPIO 输入即可。默认 PA12——PWMAB C0（motor 双路
// PWM）+ BH1750 SCL 重叠：指纹与双电机/光照同选概率最低，同选时经引脚绑定
// 消解；与同批 jq8900/syn6288/rc522 默认不撞）
const FINGERPRINT = GPIO.addInstance();
FINGERPRINT.$name = "FINGERPRINT";
FINGERPRINT.associatedPins.create(1);
FINGERPRINT.associatedPins[0].$name        = "TOUCH";
FINGERPRINT.associatedPins[0].direction    = "INPUT";
FINGERPRINT.associatedPins[0].pin.$assign  = "PA12";

// LED/蜂鸣器输出（PA15；原 LaunchPad 值 PA3 = 32.768k 晶振脚，地猛星排针未引出）
LED_BEEP.$name = "LED_BEEP";
LED_BEEP.associatedPins.create(1);
LED_BEEP.associatedPins[0].$name        = "LED";
LED_BEEP.associatedPins[0].direction    = "OUTPUT";
LED_BEEP.associatedPins[0].initialValue = "CLEARED";
LED_BEEP.associatedPins[0].pin.$assign  = "PA15";

// 步进电机方向/使能（step_motor 模块：宏 STEP_MOTOR_RST2/SLP2/DIR2/DCY2_PIN，
// 四脚同 GPIOB → STEP_MOTOR_PORT = GPIOB；RST2/SLP2 空闲高有效，init 置高）
STEP_MOTOR.$name = "STEP_MOTOR";
STEP_MOTOR.associatedPins.create(4);
STEP_MOTOR.associatedPins[0].$name        = "RST2";
STEP_MOTOR.associatedPins[0].direction    = "OUTPUT";
STEP_MOTOR.associatedPins[0].initialValue = "SET";
STEP_MOTOR.associatedPins[0].pin.$assign  = "PB24";
STEP_MOTOR.associatedPins[1].$name        = "SLP2";
STEP_MOTOR.associatedPins[1].direction    = "OUTPUT";
STEP_MOTOR.associatedPins[1].initialValue = "SET";
STEP_MOTOR.associatedPins[1].pin.$assign  = "PB6";
STEP_MOTOR.associatedPins[2].$name        = "DIR2";
STEP_MOTOR.associatedPins[2].direction    = "OUTPUT";
STEP_MOTOR.associatedPins[2].initialValue = "CLEARED";
STEP_MOTOR.associatedPins[2].pin.$assign  = "PB7";
STEP_MOTOR.associatedPins[3].$name        = "DCY2";
STEP_MOTOR.associatedPins[3].direction    = "OUTPUT";
STEP_MOTOR.associatedPins[3].initialValue = "CLEARED";
STEP_MOTOR.associatedPins[3].pin.$assign  = "PB8";

// IMU 串口（RX 中断；UART0 = PA28(TX)/PA31(RX)——板载 CH340E 占用 UART0 默认脚
// PA10/PA11，勿用；imu_uart 模块接线注释同步此值）
IMU601.$name             = "IMU601";
IMU601.profile           = "CONFIG_PROFILE_1";
IMU601.peripheral.$assign = "UART0";
IMU601.uartClkSrc        = "BUSCLK";
IMU601.ovsRate           = "16";
IMU601.targetBaudRate    = 115200;
IMU601.enableInternalLoopback = false;
IMU601.enabledInterrupts = ["RX"];
IMU601.enableFIFO        = false;
IMU601.peripheral.rxPin.$assign = "PA31";
IMU601.peripheral.txPin.$assign = "PA28";

